#include <bits/stdc++.h>
using namespace std;

// 1 : 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 : 10
// 2 : 00, 01, 02, 03, 04, 05, 06, 07, 08, 09 - 10
//     11, 12, 13, ... - 9
//     22 ... - 8
//     33 ... - 7
//     44 ... - 6
//     99  - 1
//     : 55

// 길이가 2이면서 0 으로 끝나는거 1
// 길이가 2이면서 1 으로 끝나는거 2
// 길이가 2이면서 2 으로 끝나는거 3

//    0 1 2 3 4 5 6 7 8 9
// 1  1 1 1 1 1 1 1 1 1 1 : 10
// 2  1 2 3 4 5 6 7 8 9 10 : 55
// 3  1 3 6 10 15 21 28 36 45 55 : 220
const int mod = 10'007;

int main() {
    ios::sync_with_stdio(0);
    cin.tie(0);

    // 10, 55, 220
    int N;
    cin >> N;

    long long d[1001][10];
    // d[3][7] = d[3][6] + d[2][7]
    for (int i = 1; i <= N; i++) {
        d[i][0] = 1;
        for (int j = 1; j < 10; j++) {
            d[i][j] = (d[i][j - 1] + d[i - 1][j]) % mod;
        }
    }

    long long ans = 0;

    for (int i = 0; i < 10; i++) {
        ans += d[N][i];
    }

    cout << ans % mod << '\n';
}